<?php
////////////////////////////////////////////////////////////////////////////////////////////////////1
// Первый пункт из задания
echo "<hr>";
echo "Первый пункт из задания" . "<hr>";
echo "Числа от 0 до 100, которые делятся без остатка на 3:" . "<br>";
$a = 0;
while($a <= 100) {
    if($a % 3 == 0)
 echo "$a ";
 $a++;
}
echo "<br>";
echo "<br>";


////////////////////////////////////////////////////////////////////////////////////////////////////2
// Второй пункт из задания
echo "<hr>";
echo "Второй пункт из задания" . "<hr>";
echo "Вывод и разделение чисел от 0 до 10 на чётные и нечётные" . "<br>";
$a = 0;
do {
    if($a % 2 == 0 && $a != 0) 
    echo "$a - чётное число." . "<br>";
    elseif($a == 0)
    echo "$a - это ноль." . "<br>";
    else
    echo "$a  - нечётное число." . "<br>";
 $a++;
}while($a<=10);

?>
<br>
<?php
////////////////////////////////////////////////////////////////////////////////////////////////////3
// Третий пункт из задания
echo "<hr>";
echo "Третий пункт из задания" . "<hr>";
$arrayC = [
    'Московская область' => ['Москва','Дмитров','Дзержинский','Жуковский','Звенигород'],
    'Ростовская область' => ['Азов','Волгодонск','Зерноград','Морозовск','Таганрог'],
    'Ленинградская область' => ['Высоцк','Кировск','Луга','Никольское','Отрадное'],
    'Магаданская область' => ['Магадан','Сусуман']
];

foreach($arrayC as $key => $val) {
    echo "$key: " . "<br>" . implode(", ", $val) . "." . "<br>";
}

?>
<br>
<?php
////////////////////////////////////////////////////////////////////////////////////////////////////4
// Четвёртый пункт из задания
echo "<hr>";
echo "Четвёртый пункт из задания" . "<hr>";
//Транслитерация текста 
function trans($x) {
    $massive = [
        'а' => 'a',    'з' => 'z',      'п' => 'p',        'ч' => 'ch',
        'б' => 'b',    'и' => 'i',      'р' => 'r',        'ш' => 'sh',
        'в' => 'v',    'й' => 'iy',     'с' => 's',        'щ' => 'sh\'',
        'г' => 'g',    'к' => 'k',      'т' => 't',        'ъ' => '\*',
        'д' => 'd',    'л' => 'l',       'у' => 'u',        'ы' => 'ii',
        'е' => 'e',    'м' => 'm',      'ф' => 'f',        'ь' => '\^',
        'ё' => 'yo',   'н' => 'n',      'х' => 'h',        'э' => 'ae',
        'ж' => 'je',   'о' => 'o',      'ц' => 'c',        'ю' => 'you',
        'я' => 'ya',
// Заглавные буквы
        'А' => 'A',    'З' => 'Z',      'П' => 'P',        'Ч' => 'Ch',
        'Б' => 'B',    'И' => 'I',      'Р' => 'R',        'Ш' => 'Sh',
        'В' => 'V',    'Й' => 'Iy',     'С' => 'S',        'Щ' => 'Sh\'',
        'Г' => 'G',    'К' => 'K',      'Т' => 'T',        'Ъ' => '\*',
        'Д' => 'D',    'Л' => 'L',      'У' => 'U',        'Ы' => 'Ii',
        'Е' => 'E',    'М' => 'M',      'Ф' => 'F',        'Ь' => '\^',
        'Ё' => 'Yo',   'Н' => 'N',      'Х' => 'H',        'Э' => 'Ae',
        'Ж' => 'Ge',   'О' => 'O',      'Ц' => 'C',        'Ю' => 'You',
        'Я' => 'Ya'  
    ];
    return strtr($x, $massive);
}
echo trans("География") . "<br>";
echo "<br>";

////////////////////////////////////////////////////////////////////////////////////////////////////5
// Пятый пункт из задания
echo "<hr>";
echo "Пятый пункт из задания" . "<hr>";
// Замена пробелов на подчёркивания
function change($podcherk) {
    $c = [' ' => '_'];
    return strtr($podcherk, $c);
}
echo change("Человек должен быть честным по натуре, а не по обстоятельствам (с)Марк Аврелий") . "<br>";
echo "<br>";

////////////////////////////////////////////////////////////////////////////////////////////////////6
// Шестой пункт из задания
echo "<hr>";
echo "Шестой пункт из задания" . "<hr>";
?>
<html>
<?php
$menu = [
    'main.html' => ['Главная' => ['Новости портала' => 'Архив новостей']], // ссылка на страницу => меню => подменю
    'catalog.html' => ['Каталог' => ['Бритвы' => 'Пылесосы']],        
    'akcii.html' => ['Акции' => ['Актуальные' => 'Архив']],
    'onas.html' => ['О нас' => ['Контакты' => 'Наша команда']]
];
?>
<ul>
<?php foreach($menu as $a => $b){ //Перебор ссылок ведущих на нужные страницы ?>  
         <a href="<?= $a; ?>"><?php foreach($b as $link => $m){ //Перебор основных пунктов меню ?>
             <li><?= $link; ?></li>
         </a>  
    <a name="check"></a>  <!-- Закладка / Якорь --> 
         <a href="#check"><?php foreach($m as $h => $s){ //Перебор массивов с подменю ?>
             <li><?= "-  $h"; ?></li>
         </a>     
         <a href="#check">
             <li><?= "-  $s";}}} ?></li> 
         </a>
</ul>
</html>
<br>
<?php

////////////////////////////////////////////////////////////////////////////////////////////////////7
// Седьмой пункт из задания
echo "<hr>";
echo "Седьмой пункт из задания" . "<hr>";
// С помощь 'for' без тела функции вывести числа от 0 до 9
for($a = 0; print "$a ", 9 >= ++$a;) {}
?>
<br>
<br>
<?php
////////////////////////////////////////////////////////////////////////////////////////////////////8
// Восьмой пункт из задания
echo "<hr>";
echo "Восьмой пункт из задания" . "<hr>";

/* Создаём массив $j, чтобы потом иметь возможность упорядочить результат выборки иного массива ($v)
через запятую и в конце воткнуть точку  */
$j =[];
foreach ($arrayC as $k => $v) {
    foreach($v as $n)
    if(mb_substr($n, 0, 1) == "М")
        $j[] = $n;        
}
echo 'Города на выбранную букву:' . "<br>" . implode(", ", $j) . ".";

?>
<br>
<br>
<?php
////////////////////////////////////////////////////////////////////////////////////////////////////9
// Девятый пункт из задания
echo "<hr>";
echo "Девятый пункт из задания" . "<hr>";
function trans_with_podcherk($y) {
    $massive = [
        'а' => 'a',    'з' => 'z',      'п' => 'p',        'ч' => 'ch',
        'б' => 'b',    'и' => 'i',      'р' => 'r',        'ш' => 'sh',
        'в' => 'v',    'й' => 'iy',     'с' => 's',        'щ' => 'sh\'',
        'г' => 'g',    'к' => 'k',      'т' => 't',        'ъ' => '\*',
        'д' => 'd',    'л' => 'l',       'у' => 'u',        'ы' => 'ii',
        'е' => 'e',    'м' => 'm',      'ф' => 'f',        'ь' => '\^',
        'ё' => 'yo',   'н' => 'n',      'х' => 'h',        'э' => 'ae',
        'ж' => 'je',   'о' => 'o',      'ц' => 'c',        'ю' => 'you',
        'я' => 'ya',

        'А' => 'A',    'З' => 'Z',      'П' => 'P',        'Ч' => 'Ch',
        'Б' => 'B',    'И' => 'I',      'Р' => 'R',        'Ш' => 'Sh',
        'В' => 'V',    'Й' => 'Iy',     'С' => 'S',        'Щ' => 'Sh\'',
        'Г' => 'G',    'К' => 'K',      'Т' => 'T',        'Ъ' => '\*',
        'Д' => 'D',    'Л' => 'L',      'У' => 'U',        'Ы' => 'Ii',
        'Е' => 'E',    'М' => 'M',      'Ф' => 'F',        'Ь' => '\^',
        'Ё' => 'Yo',   'Н' => 'N',      'Х' => 'H',        'Э' => 'Ae',
        'Ж' => 'Ge',   'О' => 'O',      'Ц' => 'C',        'Ю' => 'You',
        'Я' => 'Ya',   ' ' => '_' // <== Просто добавили одну строчку для замены пробелов на подчерки
    ];
    return strtr($y, $massive);
}
echo trans_with_podcherk("К л а у с т р о ф о б и я") . "<br>";
echo "<br>";
?>
