<?php
    $a = 5;
    $b = '05';
    var_dump($a == $b);         // Почему true?
    // Потому, что сравнивается содержимое переменных. А содержимое и там и там число, равное 5
   
    var_dump((int)'012345');     // Почему 12345?
    // Потому, что цифра не может начинаться с нуля. Во всяком случаи целая.
    
    var_dump((float)123.0 === (int)123.0); // Почему false?
    // Потому, что три тут сравнивается и содержимое и тип данных. Содержимое одинаково, а тип данных разный
    
    var_dump((int)0 === (int)'hello, world'); // Почему true?
    //Потому, что строка(текст) в цифровом виде, для машины - это 0. Мы принудительно уравниваем типы данных и тогда строка 
    //становится числом, а содержимое и там и там будет 0.
?>

//Поменять переменные местами
<?php
$a = 1;
$b = 2;

echo ++$a ;
echo --$b ;
?>