<?php 
// Подключение к базе данных
    $side = mysqli_connect("localhost", "root", "", "myBase");

//Сортируем все элементы таблицы employee по значению в столбце clicks, в обратном порядке
    $url = mysqli_query($side,"SELECT * FROM employee ORDER BY clicks DESC");

//Создаём пустой массив, чтобы сложить туда отсортированную выборку нашей таблицы
    $sites = [];

//Цикл для построчного извлечения всех отсортированных значений нашей таблицы и помещение этих значений в массив, так данные можно будет удобно извлечь
        while($i = mysqli_fetch_assoc($url)) 

//Наполненный массив с отсортированными значениями
        $sites[] = $i; 
?>